In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
df.loc[0] = ['Allen', '22', '175']

In [5]:
df

    Name Age Height
0  Allen  22    175

In [6]:
df.loc[1] = ['Ted', '25', '180']

In [7]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [8]:
df['Weight'] = ['75', '80']

In [9]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [10]:
df.drop(['Height'], axis=1)

    Name Age Weight
0  Allen  22     75
1    Ted  25     80

In [11]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [12]:
df = df.drop(['Height'], axis=1)

In [13]:
df

    Name Age Weight
0  Allen  22     75
1    Ted  25     80

In [14]:
df.drop(1)

    Name Age Weight
0  Allen  22     75

In [15]:
df

    Name Age Weight
0  Allen  22     75
1    Ted  25     80

In [16]:
df = df.drop(1)

In [17]:
df

    Name Age Weight
0  Allen  22     75

In [20]:
df.to_csv('./testPandas.csv', index=False)

In [21]:
df2 = pd.read_csv('./testPandas.csv')

In [22]:
df2

    Name  Age  Weight
0  Allen   22      75

In [23]:
df3 = df2

In [24]:
df3

    Name  Age  Weight
0  Allen   22      75

In [25]:
df2

    Name  Age  Weight
0  Allen   22      75

In [26]:
df3[0] = '0'

In [27]:
df3

    Name  Age  Weight  0
0  Allen   22      75  0

In [28]:
df2

    Name  Age  Weight  0
0  Allen   22      75  0

In [29]:
df4 = df2.copy()

In [30]:
df4

    Name  Age  Weight  0
0  Allen   22      75  0

In [31]:
df2

    Name  Age  Weight  0
0  Allen   22      75  0

In [32]:
df4.loc[1] = '123'

In [33]:
df4

    Name  Age Weight    0
0  Allen   22     75    0
1    123  123    123  123

In [34]:
df2

    Name  Age  Weight  0
0  Allen   22      75  0

In [35]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '22', '175'],
    ['Ted', '25', '180']
]

In [36]:
new_df = pd.DataFrame(data=data, columns=columns)

In [37]:
new_df

    Name Age Height
0  Allen  22    175
1    Ted  25    180